In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({"Name":["Mohan", "Andrea", "Sofia", "Joe", "Virat", "Abdul"],
                  "Score":[75, 72, 68, 65, 67, 73]})
df

     Name  Score
0   Mohan     75
1  Andrea     72
2   Sofia     68
3     Joe     65
4   Virat     67
5   Abdul     73

In [3]:
df.describe()

           Score
count   6.000000
mean   70.000000
std     3.898718
min    65.000000
25%    67.250000
50%    70.000000
75%    72.750000
max    75.000000

In [4]:
df = pd.DataFrame({"Name":["Mohan", "Andrea", "Sofia", "Joe", "Virat", "Abdul"],
                   "Score":[93, 96, 43, 47, 100, 90]})
df

     Name  Score
0   Mohan     93
1  Andrea     96
2   Sofia     43
3     Joe     47
4   Virat    100
5   Abdul     90

In [5]:
df.describe()

            Score
count    6.000000
mean    78.166667
std     25.933890
min     43.000000
25%     57.750000
50%     91.500000
75%     95.250000
max    100.000000

In [6]:
df.std()

Score    25.93389
dtype: float64